{"idioms": [{"phrase": "\"Rub It In: Teasing someone to make them feel even worse after a defeat.", "context": ["Alright", " you beat me. But there’s no need to rub it in.\""]}, {"phrase": "\"Walk on Eggshells: Being very careful when you are dealing with a very tense situation/person.", "context": ["After our argument last night", " I feel like I’m walking on eggshells around her today.\""]}, {"phrase": "\"See Something Out of the Corner of Your Eye: Use peripheral vision", "context": ["I saw movement out of the corner of my eye and was able to pick out the person hiding.\""]}, {"phrase": "\"Speak of the Devil (and He Shall Appear): when you have been talking about someone and they immediately walk in..", "context": ["Speak of the devil", " here he is!\""]}, {"phrase": "\"Sweet Dreams!: I hope you get great sleep tonight.", "context": ["Goodnight", " sweet dreams.\""]}, {"phrase": "\"Wild Goose Chase: going to search for something which seems to yield no results.", "context": ["He led us on a wild goose chase", " we didn;t even find any evidence.\""]}, {"phrase": "\"Sneak Peek: Getting to see someone early before it is completed or made public to the world.", "context": ["Can I get a sneak peek of your new song before it’s released?\""]}, {"phrase": "\"Second Wind: Regaining your energy.", "context": ["I found my second wind near the end of the basketball.\""]}, {"phrase": "\"Scare the Living Daylights Out of Someone: To be terrified by someone.", "context": ["Christ", " you scared the living daylights out of me! Don’t creep up on me again.\""]}, {"phrase": "\"Touch One’s Heart: Affect someone emotionally, be touching.", "context": ["Your letter of gratitude touched my heart.\""]}, {"phrase": "\"Throw Someone Under the Bus: Revealing something that someone did that wasn’t meant to be known.", "context": ["Why did you have to throw him under the bus! He wasn’t ready to tell people about his sexuality yet.\""]}, {"phrase": "\"The tables have turned: Reverse a situation, you now have the upper hand in a situation where you previously had the lower hand. (This works vice versa).", "context": ["Oh", " would you look at how the tables have turned! It looks like you’ll be the one apologising to me", " not the other way around.\""]}, {"phrase": "\"Take a Deep Dive (Into): To go depth with your exploration.", "context": ["I’m going to take a deep dive into the topic of racial prejudice in Europe through the 90s.\""]}, {"phrase": "\"Rear Its Ugly Head: A problem that comes out unexpectedly.", "context": ["CAncer reared its ugly head.\""]}, {"phrase": "\"We’ll Cross That Bridge: When the problem has arrived and can’t be ignored anymore then we will think of a solution.", "context": ["“What about if it rains on the day?” “We’ll cross that bridge when we come to it.”\""]}, {"phrase": "\"Run in the Family: A particular trait/behavior that seems to be common in a family.", "context": ["Impatience seems to run in the family.\""]}, {"phrase": "\"Third Time’s a Charm/Third Time Lucky: Even if you’ve failed the last two times you still have one more go, and that is likely to come out with a positive result.", "context": ["I failed my driving test twice. But hey ho", " third time lucky...\""]}, {"phrase": "\"Trash Talk: Insults directed at one’s opponent in a sporting event or contest.", "context": ["They’re giving each other trash talk in the pre match interviews.\""]}, {"phrase": "\"Tongue-in-Cheek: Said ironically; not meant to be taken seriously.", "context": ["I only meant it tongue in cheek", " don’t take it too seriously.\""]}, {"phrase": "\"Take The Mickey (Piss) (Out Of Someone):To have banter with someone but making fun of them.", "context": ["Hey", " stop taking the mickey out of me!\""]}, {"phrase": "\"Up in Arms: Angry, protesting (usually said of a group).", "context": ["The fans are up in arms about the way the chairman has conducted business.\""]}, {"phrase": "\"Test the Waters: Try something out in a preliminary way.", "context": ["Before going all in", " we need to test the waters first.\""]}, {"phrase": "\"Where There’s a Will, There’s a Way: If you have a strong desire to accomplish something, you will achieve it even in the face of considerable odds.", "context": ["I don’t know how I’m going to make it", " but when there’s a will", " there’s a way.\""]}, {"phrase": "\"Up for Grabs: It’s free for anyone to take.", "context": ["At this point in the game", " first prize is still up for grabs.\""]}, {"phrase": "\"Turn Something on Its Head: Reverse something, cause something to be done in a new way.", "context": ["The new variant of the disease has turned the country’s healing efforts on it’s head.\""]}, {"phrase": "\"Take a Hike: Go away you're not wanted.", "context": ["Take a hike", " this is an invite only club.\""]}, {"phrase": "\"To be Smitten With Someone: To like and fancy someone", "context": ["He’s absolutely smitten with his new girlfriend.\""]}, {"phrase": "\"Rookie Mistake: An error made by someone who is inexperienced.", "context": ["Sticking your finger in the dog’s mouth was a rookie mistake.\""]}, {"phrase": "\"Short Fuse: Someone that can easily get angry and reacts abrupts quickly.", "context": ["he’s got a short fuse so don’t tease him too much.\""]}, {"phrase": "\"Window Shop: To look at merchandise in a store without intending to buy it.", "context": ["I haven’t got much money", " but we can go window shopping.\""]}, {"phrase": "\"Tough Cookie: Someone who has a strong spirit, with a lot of determination and is able to persevere in hard situations.", "context": ["He’ll be fine with his injury", " he’s a tough cookie.\""]}, {"phrase": "\"Under the Weather: not feeling very well.", "context": ["She won’t be at work today", " she’s been under the weather.\""]}, {"phrase": "\"Tie the Knot: Get married.", "context": ["My best friend tied the knot yesterday.\""]}, {"phrase": "\"Your Guess Is as Good as Mine: I don’t know; I have no idea.", "context": ["“What ever happened to Carly Rae Jepsen?” “Your guess is as good as mine.”\""]}, {"phrase": "\"Sitting Duck: Something or someone easily attacked or criticized.", "context": ["The elderly are sitting ducks. Let’s rob them.\""]}, {"phrase": "\"Take Something with a Pinch (grain) of Salt: Don't think what people say too seriously.", "context": ["He said he used to play for England", " but I’d take what he said with a pinch of salt.\""]}, {"phrase": "\"Soak Up the Sun: enjoy the sunshine.", "context": ["I’m soaking up the sun today.\""]}, {"phrase": "\"The odds are stacked against you: You are in an Unfavorable situation where success is unlikely.", "context": ["The odds are stacked against you", " it’ll take a lot of hard work to even match him", " let alone beat him.\""]}, {"phrase": "\"Show One’s True Colors: someone's who reveals their true intentions.", "context": ["After all that lying", " he’s shown his true colours.\""]}, {"phrase": "\"Start with a Clean Slate: Having a fresh start and forgetting about the past attempts to do something.", "context": ["Although we had a rough time yesterday", " today we start with a clean slate.\""]}, {"phrase": "\"Take the High Road: Being the more moral person in an argument and diffusing the argument even though you are right.", "context": ["If you say so. I’m going to take the high road and leave it.\""]}, {"phrase": "\"To be the Apple of Someone’s Eye: To be loved and treasured by someone", "context": ["You’re the apple of my eye", " i can’t live without you.\""]}, {"phrase": "\"Sweeten the Deal: Making a deal more attractive by adding a diresable offer to the mix.", "context": ["I’ll sweeten the deal; how about a bonus paycheck too?\""]}, {"phrase": "\"Turn a Blind Eye: To choose to ignore something.", "context": ["Seeing as I don’t have the time to deal with another drug possession case", " I’m going to turn a blind eye.\""]}, {"phrase": "\"Steal Someone’s Thunder: To outshine and out perform someone who was previously seen/has the reputation as the best at something.", "context": ["Don’t steal my thunder", " that was my joke!\""]}, {"phrase": "\"That’s a Stretch: someone exaggerated a fact or a story, or someone coming to a concussion that’s presumptuous.", "context": ["He said he fought them all off by himself? Hmmmm", " I don't know about that", " that’s a stretch.\""]}, {"phrase": "\"Sold On (Something): Convinced of something.", "context": ["I’m sold on the idea", " let’s make it happen!\""]}, {"phrase": "\"See Eye to Eye: To finally agree on something.", "context": ["I’m glad we can see eye to eye on this important topic.\""]}, {"phrase": "\"Your Number Is Up: You are going to die (or suffer some bad misfortune or setback).", "context": ["Your number is up. You’re going to jail for the rest of your life.\""]}, {"phrase": "\"You Know the Drill: You are already familiar with the procedure.", "context": ["Alright", " same task as we do every monday guys", " you know the drill.\""]}, {"phrase": "\"To Pop (one’s) Cherry: To lose your virginity.", "context": ["I popped her cherry.\""]}, {"phrase": "\"You Can Say That Again!: I agree totally!", "context": ["“This food is exquisite.” “Mmmm. You can say that again.”\""]}, {"phrase": "\"Teach an Old Dog New Tricks: trying to change a person's perspective on a subject that they have long held a strong opinion on.", "context": ["The veteran salesman isn’t going to listen to your story about how you’ve increased sales through using social media. You can’t teach an old dog new tricks.\""]}, {"phrase": "\"To Each His Own: People have different preferences.", "context": ["I wouldn’t smoke cigarettes myself", " but each to their own.\""]}, {"phrase": "\"Up to Scratch: Meeting a basic standard of competence or quality.", "context": ["Your first draft was unfortunately not up to scratch.\""]}]}